In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
arr = np.array([[1, 2, np.nan],[np.nan, 3, 4]])

In [3]:
dframe1 = DataFrame(arr, index=['A','B'], columns=['One','Two','Three'])

In [4]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [5]:
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [8]:
dframe1.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [10]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [11]:
dframe1.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [12]:
dframe1.idxmin()

One      A
Two      A
Three    B
dtype: object

In [13]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [14]:
dframe1.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [15]:
dframe1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [48]:
from pandas_datareader import data as pdr

import fix_yahoo_finance as yf

yf.pdr_override()

import datetime

In [51]:
# # download dataframe
# data = pdr.get_data_yahoo("SPY", start="2017-01-01", end="2017-04-30")

# # download Panel
# data = pdr.get_data_yahoo(["SPY", "IWM"], start="2017-01-01", end="2017-04-30")
prices = pdr.get_data_yahoo(['CVX','XOM','BP'], start=datetime.datetime(2010,1,1),
                           end=datetime.datetime(2013,1,1))['Adj Close']
prices.head()

[*********************100%***********************]  3 of 3 downloaded

                   BP        CVX        XOM
Date
2009-12-31  37.197845  55.723492  52.244282
2010-01-04  37.955013  57.221714  52.979797
2010-01-05  38.224525  57.627045  53.186668
2010-01-06  38.423439  57.634270  53.646351
2010-01-07  38.410614  57.417149  53.477802